---
kind: property
id: P:Autodesk.Revit.DB.Architecture.BalusterPattern.DistributionJustification
source: html/f9108468-6603-5766-52fb-9914c441d59b.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPattern.DistributionJustification Property

Determines how baluster pattern distribution is justified.

## Syntax (C#)
```csharp
public PatternJustification DistributionJustification { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration